# DataFrame (2-Dimensional DataSet)

In [1]:
import numpy as np
import pandas as pd

In [2]:
data={'Name': ['Deepak','Chirag','Ayushi','Ankita','Aman','Ajay'], 'Age':[25, 24, 24, 23, 24, 25], 'Schooking':['KV','Private','SX','Navoday','Private','Public']}
data

{'Name': ['Deepak', 'Chirag', 'Ayushi', 'Ankita', 'Aman', 'Ajay'],
 'Age': [25, 24, 24, 23, 24, 25],
 'Schooking': ['KV', 'Private', 'SX', 'Navoday', 'Private', 'Public']}

In [3]:
dataf = pd.DataFrame(data)
dataf

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [4]:
datas = pd.Series(data)
datas

Name         [Deepak, Chirag, Ayushi, Ankita, Aman, Ajay]
Age                              [25, 24, 24, 23, 24, 25]
Schooking     [KV, Private, SX, Navoday, Private, Public]
dtype: object

## Problem Statement

### If we have serires in which data is present as key-value pair and values contain a list of elements. Look at above Series

## First Solution

In [5]:
datan = datas['Name']
datan

['Deepak', 'Chirag', 'Ayushi', 'Ankita', 'Aman', 'Ajay']

In [6]:
dataa = datas['Age']
dataa

[25, 24, 24, 23, 24, 25]

In [7]:
datasc = datas['Schooking']
datasc

['KV', 'Private', 'SX', 'Navoday', 'Private', 'Public']

In [8]:
datasd = {'Name': pd.Series(datan), 'Age': pd.Series(dataa), 'Schooking': pd.Series(datasc)}
datasd

{'Name': 0    Deepak
 1    Chirag
 2    Ayushi
 3    Ankita
 4      Aman
 5      Ajay
 dtype: object,
 'Age': 0    25
 1    24
 2    24
 3    23
 4    24
 5    25
 dtype: int64,
 'Schooking': 0         KV
 1    Private
 2         SX
 3    Navoday
 4    Private
 5     Public
 dtype: object}

In [9]:
datasd = pd.DataFrame(datasd)
datasd

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

## Second Solution

In [10]:
datass = {'Name':pd.Series(datas['Name']), 'Age':pd.Series(datas['Age']), 'Schooking':pd.Series(datas['Schooking'])}
datass

{'Name': 0    Deepak
 1    Chirag
 2    Ayushi
 3    Ankita
 4      Aman
 5      Ajay
 dtype: object,
 'Age': 0    25
 1    24
 2    24
 3    23
 4    24
 5    25
 dtype: int64,
 'Schooking': 0         KV
 1    Private
 2         SX
 3    Navoday
 4    Private
 5     Public
 dtype: object}

In [11]:
datassd = pd.DataFrame(datass)
datassd

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

## Final Solution

In [12]:
df = pd.DataFrame({'Name':pd.Series(datas['Name']), 'Age':pd.Series(datas['Age']), 'Schooking':pd.Series(datas['Schooking'])})

In [13]:
df

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

# Adding Columns

In [14]:
df

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [15]:
df['Location'] = pd.Series(['Bhopal','Saidol','Bhopal','Aasta','Riwa'], index=[0,1,2,4,5])
df

     Name  Age Schooking Location
0  Deepak   25        KV   Bhopal
1  Chirag   24   Private   Saidol
2  Ayushi   24        SX   Bhopal
3  Ankita   23   Navoday      NaN
4    Aman   24   Private    Aasta
5    Ajay   25    Public     Riwa

### Delect Columns

In [16]:
dfc = df
dfc

     Name  Age Schooking Location
0  Deepak   25        KV   Bhopal
1  Chirag   24   Private   Saidol
2  Ayushi   24        SX   Bhopal
3  Ankita   23   Navoday      NaN
4    Aman   24   Private    Aasta
5    Ajay   25    Public     Riwa

In [17]:
Schooling=df['Schooking']
Schooling

0         KV
1    Private
2         SX
3    Navoday
4    Private
5     Public
Name: Schooking, dtype: object

In [18]:
del dfc['Schooking']
dfc

     Name  Age Location
0  Deepak   25   Bhopal
1  Chirag   24   Saidol
2  Ayushi   24   Bhopal
3  Ankita   23      NaN
4    Aman   24    Aasta
5    Ajay   25     Riwa

#### We can also pop() method to delete columns
dfc.pop('Schooking')

In [19]:
dfc['Schooling'] = pd.Series(Schooling)
dfc

     Name  Age Location Schooling
0  Deepak   25   Bhopal        KV
1  Chirag   24   Saidol   Private
2  Ayushi   24   Bhopal        SX
3  Ankita   23      NaN   Navoday
4    Aman   24    Aasta   Private
5    Ajay   25     Riwa    Public

In [20]:
dfc[['Name','Location']]

     Name Location
0  Deepak   Bhopal
1  Chirag   Saidol
2  Ayushi   Bhopal
3  Ankita      NaN
4    Aman    Aasta
5    Ajay     Riwa

## Action on Rows, Select, add, delete, and slice

In [21]:
dfc

     Name  Age Location Schooling
0  Deepak   25   Bhopal        KV
1  Chirag   24   Saidol   Private
2  Ayushi   24   Bhopal        SX
3  Ankita   23      NaN   Navoday
4    Aman   24    Aasta   Private
5    Ajay   25     Riwa    Public

#### First Solution to set index for existing DataFrame

In [22]:
dfcnd= np.array(dfc)
dfcnd

array([['Deepak', 25, 'Bhopal', 'KV'],
       ['Chirag', 24, 'Saidol', 'Private'],
       ['Ayushi', 24, 'Bhopal', 'SX'],
       ['Ankita', 23, nan, 'Navoday'],
       ['Aman', 24, 'Aasta', 'Private'],
       ['Ajay', 25, 'Riwa', 'Public']], dtype=object)

In [23]:
dfcr = pd.DataFrame(dfcnd, 
                    columns=['Name','Age','Location','Schooling'], 
                    index=['101','102','103','104','105','106'])
dfcr

       Name Age Location Schooling
101  Deepak  25   Bhopal        KV
102  Chirag  24   Saidol   Private
103  Ayushi  24   Bhopal        SX
104  Ankita  23      NaN   Navoday
105    Aman  24    Aasta   Private
106    Ajay  25     Riwa    Public

In [24]:
dfc

     Name  Age Location Schooling
0  Deepak   25   Bhopal        KV
1  Chirag   24   Saidol   Private
2  Ayushi   24   Bhopal        SX
3  Ankita   23      NaN   Navoday
4    Aman   24    Aasta   Private
5    Ajay   25     Riwa    Public

In [25]:
t=dfc

In [26]:
t

     Name  Age Location Schooling
0  Deepak   25   Bhopal        KV
1  Chirag   24   Saidol   Private
2  Ayushi   24   Bhopal        SX
3  Ankita   23      NaN   Navoday
4    Aman   24    Aasta   Private
5    Ajay   25     Riwa    Public

#### Second Solution to set index for existing DataFrame

In [27]:
t = pd.DataFrame(np.array(t), 
                 columns=['Name','Age','Location','Schooling'],
                 index=['101','102','103','104','105','106'] )
t

       Name Age Location Schooling
101  Deepak  25   Bhopal        KV
102  Chirag  24   Saidol   Private
103  Ayushi  24   Bhopal        SX
104  Ankita  23      NaN   Navoday
105    Aman  24    Aasta   Private
106    Ajay  25     Riwa    Public

#### Selection of Row

In [28]:
t

       Name Age Location Schooling
101  Deepak  25   Bhopal        KV
102  Chirag  24   Saidol   Private
103  Ayushi  24   Bhopal        SX
104  Ankita  23      NaN   Navoday
105    Aman  24    Aasta   Private
106    Ajay  25     Riwa    Public

In [29]:
t.loc['101']

Name         Deepak
Age              25
Location     Bhopal
Schooling        KV
Name: 101, dtype: object

In [30]:
t.iloc[2]

Name         Ayushi
Age              24
Location     Bhopal
Schooling        SX
Name: 103, dtype: object

In [31]:
t.iloc[5]

Name           Ajay
Age              25
Location       Riwa
Schooling    Public
Name: 106, dtype: object

In [39]:
t

           Name Age    Location Schooling
101      Deepak  25      Bhopal        KV
102      Chirag  24      Saidol   Private
103      Ayushi  24      Bhopal        SX
104      Ankita  23         NaN   Navoday
105        Aman  24       Aasta   Private
106        Ajay  25        Riwa    Public
107  Biswajeeta  24  Bhuneshwar    Public

In [40]:
t.iloc[0]['Name']

'Deepak'

In [41]:
t.loc['103']['Name']

'Ayushi'

In [32]:
t[2:4]

       Name Age Location Schooling
103  Ayushi  24   Bhopal        SX
104  Ankita  23      NaN   Navoday

#### Adding Row

In [33]:
tr = pd.DataFrame([['Biswajeeta','24','Bhuneshwar','Public']], 
                  columns=['Name','Age','Location','Schooling'], 
                  index=['107'])
tr

           Name Age    Location Schooling
107  Biswajeeta  24  Bhuneshwar    Public

In [34]:
t = t.append(tr)
t

           Name Age    Location Schooling
101      Deepak  25      Bhopal        KV
102      Chirag  24      Saidol   Private
103      Ayushi  24      Bhopal        SX
104      Ankita  23         NaN   Navoday
105        Aman  24       Aasta   Private
106        Ajay  25        Riwa    Public
107  Biswajeeta  24  Bhuneshwar    Public

#### Delete Row

t = t.drop(0)
t

In [35]:
t.ndim

2